MikroElektronika/core_packages/PIC/XC8/def/PIC18F44K22/mcu.h
#define                                 CK2_bit             _BIT_ACCESS(PORTD,6)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x7B6E);	// @ (0xF6D * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x7B64);	// @ (0xF6C * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// PIE2<CMIE>
extern volatile __bit                   CMIE                __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CMIE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<CMIF>
extern volatile __bit                   CMIF                __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CMIF_bit            _BIT_ACCESS(PIR2,6)
// IPR2<CMIP>
extern volatile __bit                   CMIP                __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CMIP_bit            _BIT_ACCESS(IPR2,6)
// PMD2<CMP1MD>
extern volatile __bit                   CMP1MD              __at(0x79E9);	// @ (0xF3D * 8 + 1)
#define                                 CMP1MD_bit          _BIT_ACCESS(PMD2,1)
// PMD2<CMP2MD>
extern volatile __bit                   CMP2MD              __at(0x79EA);	// @ (0xF3D * 8 + 2)
#define                                 CMP2MD_bit          _BIT_ACCESS(PMD2,2)
// CM1CON0<COE>
extern volatile __bit                   COE                 __at(0x7BCE);	// @ (0xF79 * 8 + 6)
#define                                 COE_bit             _BIT_ACCESS(CM1CON0,6)
// CM1CON0<COE1>
extern volatile __bit                   COE1                __at(0x7BCE);	// @ (0xF79 * 8 + 6)
#define                                 COE1_bit            _BIT_ACCESS(CM1CON0,6)
// CM2CON0<COE2>
extern volatile __bit                   COE2                __at(0x7BC6);	// @ (0xF78 * 8 + 6)
#define                                 COE2_bit            _BIT_ACCESS(CM2CON0,6)
// CM1CON0<CON>
extern volatile __bit                   CON                 __at(0x7BCF);	// @ (0xF79 * 8 + 7)
#define                                 CON_bit             _BIT_ACCESS(CM1CON0,7)
// CM1CON0<CON1>
extern volatile __bit                   CON1                __at(0x7BCF);	// @ (0xF79 * 8 + 7)
#define                                 CON1_bit            _BIT_ACCESS(CM1CON0,7)
// CM2CON0<CON2>
extern volatile __bit                   CON2                __at(0x7BC7);	// @ (0xF78 * 8 + 7)
#define                                 CON2_bit            _BIT_ACCESS(CM2CON0,7)
// CM1CON0<CPOL>
extern volatile __bit                   CPOL                __at(0x7BCD);	// @ (0xF79 * 8 + 5)
#define                                 CPOL_bit            _BIT_ACCESS(CM1CON0,5)
// CM1CON0<CPOL1>
extern volatile __bit                   CPOL1               __at(0x7BCD);	// @ (0xF79 * 8 + 5)
#define                                 CPOL1_bit           _BIT_ACCESS(CM1CON0,5)
// CM2CON0<CPOL2>
extern volatile __bit                   CPOL2               __at(0x7BC5);	// @ (0xF78 * 8 + 5)
#define                                 CPOL2_bit           _BIT_ACCESS(CM2CON0,5)
// CM1CON0<CREF>
extern volatile __bit                   CREF                __at(0x7BCA);	// @ (0xF79 * 8 + 2)
#define                                 CREF_bit            _BIT_ACCESS(CM1CON0,2)
// CM1CON0<CREF1>
extern volatile __bit                   CREF1               __at(0x7BCA);	// @ (0xF79 * 8 + 2)
#define                                 CREF1_bit           _BIT_ACCESS(CM1CON0,2)
// CM2CON0<CREF2>
extern volatile __bit                   CREF2               __at(0x7BC2);	// @ (0xF78 * 8 + 2)
#define                                 CREF2_bit           _BIT_ACCESS(CM2CON0,2)
// RCSTA1<CREN1>
extern volatile __bit                   CREN1               __at(0x7D5C);	// @ (0xFAB * 8 + 4)
#define                                 CREN1_bit           _BIT_ACCESS(RCSTA1,4)
// RCSTA2<CREN2>
extern volatile __bit                   CREN2               __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 CREN2_bit           _BIT_ACCESS(RCSTA2,4)
// PORTE<CS>
extern volatile __bit                   CS                  __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CS_bit              _BIT_ACCESS(PORTE,2)
// TXSTA1<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA1,7)
// TXSTA2<CSRC2>
extern volatile __bit                   CSRC2               __at(0x7B97);	// @ (0xF72 * 8 + 7)
#define                                 CSRC2_bit           _BIT_ACCESS(TXSTA2,7)
// PORTB<CTED1>
extern volatile __bit                   CTED1               __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 CTED1_bit           _BIT_ACCESS(PORTB,2)
// PORTB<CTED2>
extern volatile __bit                   CTED2               __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CTED2_bit           _BIT_ACCESS(PORTB,3)
// CTMUCONH<CTMUEN>
extern volatile __bit                   CTMUEN              __at(0x7A2F);	// @ (0xF45 * 8 + 7)
#define                                 CTMUEN_bit          _BIT_ACCESS(CTMUCONH,7)
// PIE3<CTMUIE>
extern volatile __bit                   CTMUIE              __at(0x7D1B);	// @ (0xFA3 * 8 + 3)
#define                                 CTMUIE_bit          _BIT_ACCESS(PIE3,3)
// PIR3<CTMUIF>
extern volatile __bit                   CTMUIF              __at(0x7D23);	// @ (0xFA4 * 8 + 3)
#define                                 CTMUIF_bit          _BIT_ACCESS(PIR3,3)
// IPR3<CTMUIP>
extern volatile __bit                   CTMUIP              __at(0x7D2B);	// @ (0xFA5 * 8 + 3)
#define                                 CTMUIP_bit          _BIT_ACCESS(IPR3,3)
// PMD2<CTMUMD>
extern volatile __bit                   CTMUMD              __at(0x79EB);	// @ (0xF3D * 8 + 3)
#define                                 CTMUMD_bit          _BIT_ACCESS(PMD2,3)
// CTMUCONH<CTMUSIDL>
extern volatile __bit                   CTMUSIDL            __at(0x7A2D);	// @ (0xF45 * 8 + 5)
#define                                 CTMUSIDL_bit        _BIT_ACCESS(CTMUCONH,5)
// PORTC<CTPLS>
extern volatile __bit                   CTPLS               __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CTPLS_bit           _BIT_ACCESS(PORTC,2)
// CTMUCONH<CTTRIG>
extern volatile __bit                   CTTRIG              __at(0x7A28);	// @ (0xF45 * 8 + 0)
#define                                 CTTRIG_bit          _BIT_ACCESS(CTMUCONH,0)
// PORTA<CVREF>
extern volatile __bit                   CVREF               __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 CVREF_bit           _BIT_ACCESS(PORTA,2)
// SSP1STAT<DA>
extern volatile __bit                   DA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<DA1>
extern volatile __bit                   DA1                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA1_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DA2>
extern volatile __bit                   DA2                 __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 DA2_bit             _BIT_ACCESS(SSP2STAT,5)
// VREFCON1<DACEN>
extern volatile __bit                   DACEN               __at(0x7A0F);	// @ (0xF41 * 8 + 7)
#define                                 DACEN_bit           _BIT_ACCESS(VREFCON1,7)
// VREFCON1<DACLPS>
extern volatile __bit                   DACLPS              __at(0x7A0E);	// @ (0xF41 * 8 + 6)
#define                                 DACLPS_bit          _BIT_ACCESS(VREFCON1,6)
// VREFCON1<DACNSS>
extern volatile __bit                   DACNSS              __at(0x7A08);	// @ (0xF41 * 8 + 0)
#define                                 DACNSS_bit          _BIT_ACCESS(VREFCON1,0)
// VREFCON1<DACOE>
extern volatile __bit                   DACOE               __at(0x7A0D);	// @ (0xF41 * 8 + 5)
#define                                 DACOE_bit           _BIT_ACCESS(VREFCON1,5)
// PORTA<DACOUT>
extern volatile __bit                   DACOUT              __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 DACOUT_bit          _BIT_ACCESS(PORTA,2)
// VREFCON1<DACPSS0>
extern volatile __bit                   DACPSS0             __at(0x7A0A);	// @ (0xF41 * 8 + 2)
#define                                 DACPSS0_bit         _BIT_ACCESS(VREFCON1,2)
// VREFCON1<DACPSS1>
extern volatile __bit                   DACPSS1             __at(0x7A0B);	// @ (0xF41 * 8 + 3)
#define                                 DACPSS1_bit         _BIT_ACCESS(VREFCON1,3)
// VREFCON2<DACR0>
extern volatile __bit                   DACR0               __at(0x7A00);	// @ (0xF40 * 8 + 0)
#define                                 DACR0_bit           _BIT_ACCESS(VREFCON2,0)
// VREFCON2<DACR1>
extern volatile __bit                   DACR1               __at(0x7A01);	// @ (0xF40 * 8 + 1)
#define                                 DACR1_bit           _BIT_ACCESS(VREFCON2,1)
// VREFCON2<DACR2>
extern volatile __bit                   DACR2               __at(0x7A02);	// @ (0xF40 * 8 + 2)
#define                                 DACR2_bit           _BIT_ACCESS(VREFCON2,2)
// VREFCON2<DACR3>
extern volatile __bit                   DACR3               __at(0x7A03);	// @ (0xF40 * 8 + 3)
#define                                 DACR3_bit           _BIT_ACCESS(VREFCON2,3)
// VREFCON2<DACR4>
extern volatile __bit                   DACR4               __at(0x7A04);	// @ (0xF40 * 8 + 4)
#define                                 DACR4_bit           _BIT_ACCESS(VREFCON2,4)
// SSP1STAT<DATA_ADDRESS>
extern volatile __bit                   DATA_ADDRESS        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DATA_ADDRESS2>
extern volatile __bit                   DATA_ADDRESS2       __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 DATA_ADDRESS2_bit   _BIT_ACCESS(SSP2STAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x7DED);	// @ (0xFBD * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x7B34);	// @ (0xF66 * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x7B35);	// @ (0xF66 * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// CCP3CON<DC3B0>
extern volatile __bit                   DC3B0               __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 DC3B0_bit           _BIT_ACCESS(CCP3CON,4)
// CCP3CON<DC3B1>
extern volatile __bit                   DC3B1               __at(0x7AED);	// @ (0xF5D * 8 + 5)
#define                                 DC3B1_bit           _BIT_ACCESS(CCP3CON,5)
// CCP4CON<DC4B0>
extern volatile __bit                   DC4B0               __at(0x7ABC);	// @ (0xF57 * 8 + 4)
#define                                 DC4B0_bit           _BIT_ACCESS(CCP4CON,4)
// CCP4CON<DC4B1>
extern volatile __bit                   DC4B1               __at(0x7ABD);	// @ (0xF57 * 8 + 5)
#define                                 DC4B1_bit           _BIT_ACCESS(CCP4CON,5)
// CCP5CON<DC5B0>
extern volatile __bit                   DC5B0               __at(0x7AA4);	// @ (0xF54 * 8 + 4)
#define                                 DC5B0_bit           _BIT_ACCESS(CCP5CON,4)
// CCP5CON<DC5B1>
extern volatile __bit                   DC5B1               __at(0x7AA5);	// @ (0xF54 * 8 + 5)
#define                                 DC5B1_bit           _BIT_ACCESS(CCP5CON,5)
// ADCON0<DONE>
extern volatile __bit                   DONE                __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 DONE_bit            _BIT_ACCESS(ADCON0,1)
// PORTC<DT>
extern volatile __bit                   DT                  __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 DT_bit              _BIT_ACCESS(PORTC,7)
// PORTC<DT1>
extern volatile __bit                   DT1                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 DT1_bit             _BIT_ACCESS(PORTC,7)
// PORTD<DT2>
extern volatile __bit                   DT2                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 DT2_bit             _BIT_ACCESS(PORTD,7)
// BAUDCON1<DTRXP1>
extern volatile __bit                   DTRXP1              __at(0x7DC5);	// @ (0xFB8 * 8 + 5)
#define                                 DTRXP1_bit          _BIT_ACCESS(BAUDCON1,5)
// BAUDCON2<DTRXP2>
extern volatile __bit                   DTRXP2              __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 DTRXP2_bit          _BIT_ACCESS(BAUDCON2,5)
// SSP2STAT<D_A2>
extern volatile __bit                   D_A2                __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 D_A2_bit            _BIT_ACCESS(SSP2STAT,5)
// SSP2STAT<D_NOT_A2>
extern volatile __bit                   D_NOT_A2            __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 D_NOT_A2_bit        _BIT_ACCESS(SSP2STAT,5)
// SSP2STAT<D_nA2>
extern volatile __bit                   D_nA2               __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 D_nA2_bit           _BIT_ACCESS(SSP2STAT,5)
// ECCP1AS<ECCPAS0>
extern volatile __bit                   ECCPAS0             __at(0x7DB4);	// @ (0xFB6 * 8 + 4)
#define                                 ECCPAS0_bit         _BIT_ACCESS(ECCP1AS,4)
// ECCP1AS<ECCPAS1>
extern volatile __bit                   ECCPAS1             __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 ECCPAS1_bit         _BIT_ACCESS(ECCP1AS,5)
// ECCP1AS<ECCPAS2>
extern volatile __bit                   ECCPAS2             __at(0x7DB6);	// @ (0xFB6 * 8 + 6)
#define                                 ECCPAS2_bit         _BIT_ACCESS(ECCP1AS,6)
// ECCP1AS<ECCPASE>
extern volatile __bit                   ECCPASE             __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 ECCPASE_bit         _BIT_ACCESS(ECCP1AS,7)
// CTMUCONL<EDG1POL>
extern volatile __bit                   EDG1POL             __at(0x7A24);	// @ (0xF44 * 8 + 4)
#define                                 EDG1POL_bit         _BIT_ACCESS(CTMUCONL,4)
// CTMUCONL<EDG1SEL0>
extern volatile __bit                   EDG1SEL0            __at(0x7A22);	// @ (0xF44 * 8 + 2)
#define                                 EDG1SEL0_bit        _BIT_ACCESS(CTMUCONL,2)
// CTMUCONL<EDG1SEL1>
extern volatile __bit                   EDG1SEL1            __at(0x7A23);	// @ (0xF44 * 8 + 3)
#define                                 EDG1SEL1_bit        _BIT_ACCESS(CTMUCONL,3)
// CTMUCONL<EDG1STAT>
extern volatile __bit                   EDG1STAT            __at(0x7A20);	// @ (0xF44 * 8 + 0)
#define                                 EDG1STAT_bit        _BIT_ACCESS(CTMUCONL,0)
// CTMUCONL<EDG2POL>
extern volatile __bit                   EDG2POL             __at(0x7A27);	// @ (0xF44 * 8 + 7)
#define                                 EDG2POL_bit         _BIT_ACCESS(CTMUCONL,7)
// CTMUCONL<EDG2SEL0>
extern volatile __bit                   EDG2SEL0            __at(0x7A25);	// @ (0xF44 * 8 + 5)
#define                                 EDG2SEL0_bit        _BIT_ACCESS(CTMUCONL,5)
// CTMUCONL<EDG2SEL1>
extern volatile __bit                   EDG2SEL1            __at(0x7A26);	// @ (0xF44 * 8 + 6)
#define                                 EDG2SEL1_bit        _BIT_ACCESS(CTMUCONL,6)
// CTMUCONL<EDG2STAT>
extern volatile __bit                   EDG2STAT            __at(0x7A21);	// @ (0xF44 * 8 + 1)
#define                                 EDG2STAT_bit        _BIT_ACCESS(CTMUCONL,1)
// CTMUCONH<EDGEN>
extern volatile __bit                   EDGEN               __at(0x7A2B);	// @ (0xF45 * 8 + 3)
#define                                 EDGEN_bit           _BIT_ACCESS(CTMUCONH,3)
// CTMUCONH<EDGSEQEN>
extern volatile __bit                   EDGSEQEN            __at(0x7A2A);	// @ (0xF45 * 8 + 2)
#define                                 EDGSEQEN_bit        _BIT_ACCESS(CTMUCONH,2)
// EEADR<EEADR0>
extern volatile __bit                   EEADR0              __at(0x7D48);	// @ (0xFA9 * 8 + 0)
#define                                 EEADR0_bit          _BIT_ACCESS(EEADR,0)
// EEADR<EEADR1>
extern volatile __bit                   EEADR1              __at(0x7D49);	// @ (0xFA9 * 8 + 1)
#define                                 EEADR1_bit          _BIT_ACCESS(EEADR,1)
// EEADR<EEADR2>
extern volatile __bit                   EEADR2              __at(0x7D4A);	// @ (0xFA9 * 8 + 2)
#define                                 EEADR2_bit          _BIT_ACCESS(EEADR,2)
// EEADR<EEADR3>
extern volatile __bit                   EEADR3              __at(0x7D4B);	// @ (0xFA9 * 8 + 3)
#define                                 EEADR3_bit          _BIT_ACCESS(EEADR,3)
// EEADR<EEADR4>
extern volatile __bit                   EEADR4              __at(0x7D4C);	// @ (0xFA9 * 8 + 4)
#define                                 EEADR4_bit          _BIT_ACCESS(EEADR,4)
// EEADR<EEADR5>
extern volatile __bit                   EEADR5              __at(0x7D4D);	// @ (0xFA9 * 8 + 5)
#define                                 EEADR5_bit          _BIT_ACCESS(EEADR,5)
// EEADR<EEADR6>
extern volatile __bit                   EEADR6              __at(0x7D4E);	// @ (0xFA9 * 8 + 6)
#define                                 EEADR6_bit          _BIT_ACCESS(EEADR,6)
// EEADR<EEADR7>
extern volatile __bit                   EEADR7              __at(0x7D4F);	// @ (0xFA9 * 8 + 7)
#define                                 EEADR7_bit          _BIT_ACCESS(EEADR,7)
// EECON1<EEFS>
extern volatile __bit                   EEFS                __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 EEFS_bit            _BIT_ACCESS(EECON1,6)
// PIE2<EEIE>
extern volatile __bit                   EEIE                __at(0x7D04);	// @ (0xFA0 * 8 + 4)
#define                                 EEIE_bit            _BIT_ACCESS(PIE2,4)
// PIR2<EEIF>
extern volatile __bit                   EEIF                __at(0x7D0C);	// @ (0xFA1 * 8 + 4)
#define                                 EEIF_bit            _BIT_ACCESS(PIR2,4)
// IPR2<EEIP>
extern volatile __bit                   EEIP                __at(0x7D14);	// @ (0xFA2 * 8 + 4)
#define                                 EEIP_bit            _BIT_ACCESS(IPR2,4)
// EECON1<EEPGD>
extern volatile __bit                   EEPGD               __at(0x7D37);	// @ (0xFA6 * 8 + 7)
#define                                 EEPGD_bit           _BIT_ACCESS(EECON1,7)
// PMD1<EMBMD>
extern volatile __bit                   EMBMD               __at(0x79F0);	// @ (0xF3E * 8 + 0)
#define                                 EMBMD_bit           _BIT_ACCESS(PMD1,0)
// CM1CON0<EVPOL0>
extern volatile __bit                   EVPOL0              __at(0x7BCB);	// @ (0xF79 * 8 + 3)
#define                                 EVPOL0_bit          _BIT_ACCESS(CM1CON0,3)
// CM1CON0<EVPOL01>
extern volatile __bit                   EVPOL01             __at(0x7BCB);	// @ (0xF79 * 8 + 3)
#define                                 EVPOL01_bit         _BIT_ACCESS(CM1CON0,3)
// CM2CON0<EVPOL02>
extern volatile __bit                   EVPOL02             __at(0x7BC3);	// @ (0xF78 * 8 + 3)
#define                                 EVPOL02_bit         _BIT_ACCESS(CM2CON0,3)
// CM1CON0<EVPOL1>
extern volatile __bit                   EVPOL1              __at(0x7BCC);	// @ (0xF79 * 8 + 4)
#define                                 EVPOL1_bit          _BIT_ACCESS(CM1CON0,4)
// CM1CON0<EVPOL11>
extern volatile __bit                   EVPOL11             __at(0x7BCC);	// @ (0xF79 * 8 + 4)
#define                                 EVPOL11_bit         _BIT_ACCESS(CM1CON0,4)
// CM2CON0<EVPOL12>
extern volatile __bit                   EVPOL12             __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 EVPOL12_bit         _BIT_ACCESS(CM2CON0,4)
// RCSTA1<FERR1>
extern volatile __bit                   FERR1               __at(0x7D5A);	// @ (0xFAB * 8 + 2)
#define                                 FERR1_bit           _BIT_ACCESS(RCSTA1,2)
// RCSTA2<FERR2>
extern volatile __bit                   FERR2               __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 FERR2_bit           _BIT_ACCESS(RCSTA2,2)
// PORTB<FLT0>
extern volatile __bit                   FLT0                __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 FLT0_bit            _BIT_ACCESS(PORTB,0)
// EECON1<FREE>
extern volatile __bit                   FREE                __at(0x7D34);	// @ (0xFA6 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(EECON1,4)
// VREFCON0<FVREN>
extern volatile __bit                   FVREN               __at(0x7A17);	// @ (0xF42 * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(VREFCON0,7)
// VREFCON0<FVRS0>
extern volatile __bit                   FVRS0               __at(0x7A14);	// @ (0xF42 * 8 + 4)
#define                                 FVRS0_bit           _BIT_ACCESS(VREFCON0,4)
// VREFCON0<FVRS1>
extern volatile __bit                   FVRS1               __at(0x7A15);	// @ (0xF42 * 8 + 5)
#define                                 FVRS1_bit           _BIT_ACCESS(VREFCON0,5)
// VREFCON0<FVRST>
extern volatile __bit                   FVRST               __at(0x7A16);	// @ (0xF42 * 8 + 6)
#define                                 FVRST_bit           _BIT_ACCESS(VREFCON0,6)
// SSP1CON2<GCEN1>
extern volatile __bit                   GCEN1               __at(0x7E2F);	// @ (0xFC5 * 8 + 7)
#define                                 GCEN1_bit           _BIT_ACCESS(SSP1CON2,7)
// SSP2CON2<GCEN2>
extern volatile __bit                   GCEN2               __at(0x7B5F);	// @ (0xF6B * 8 + 7)
#define                                 GCEN2_bit           _BIT_ACCESS(SSP2CON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// INTCON<GIEH>
extern volatile __bit                   GIEH                __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIEH_bit            _BIT_ACCESS(INTCON,7)
// INTCON<GIEL>
extern volatile __bit                   GIEL                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 GIEL_bit            _BIT_ACCESS(INTCON,6)
// INTCON<GIE_GIEH>
extern volatile __bit                   GIE_GIEH            __at(0x7F97);	// @ (0xFF2 * 8 + 7)
#define                                 GIE_GIEH_bit        _BIT_ACCESS(INTCON,7)
// ADCON0<GO>
